DATA = [
    {
        'company': 'B.ART',
        'link': 'bart-group.com',
        'desc': 'Python developer',
        'term': '1 год 5 месяцев',
        'text': `
        <a href="https://getcrypto.ru" target="_blank">getcrypto.ru</a><br>
        Работал в команде в качестве основного backend-разработчика. Вместе мы разработали с нуля проект в Fintech сфере.<br>
        <br>
        🔹Проектирование архитектуры проекта и разбиение его на микросервисы.<br>
        🔹Построил систему общения между сервисами на основе Apache Kafka.<br>
        🔹Применял паттерн микросервисной архитектуры Transactional outbox.<br>
        🔹Разработка core-модуля для использования во всех микросервисах.<br>
        🔹Сделал систему jwt-авторизации между сервисами на основе Keycloak.<br>
        🔹Внедрял метрики Grafana, Prometheus, Sentry.<br>
        🔹Участвовал в создании CI\\CD пайплайнов в месте с devops специалистом.<br>
        🔹Реализовал систему websocket-уведомлений от сервисов на Centrifugo.<br>
        🔹Написание Docker и Docker compose конфигов.<br>
        🔹Интегрировал проект со сторонними системами Garantex, Swapster.<br>
        🔹Написание unit-тестов, нагрузочных тестов, функциональных тестов.<br>
        🔹Проведение код-ревью других разработчиков.<br>
        <br>
        Подробнее <a href="https://alex.md/#6" target="_blank"></a><br>
        <br>
        ⚡️Python, FastAPI, SqlAlchemy Alembic, Asyncio, PostgreSQL, Apache Kafka, Redis, Микросервисная архитектура, Keycloak, Centrifugo, pytest, Docker
        <div class="page-break"></div>
        `,
    },
    {
        'company': 'Scout Jobs',
        'link': 'scoutjobs.cc',
        'desc': 'Python developer',
        'term': '1 год 3 месяца',
        'text': `
        Работал в команде в качестве основного backend-разработчика. Вместе мы разработали с нуля сервис для массового найма персонала.<br>
        <br>
        🔹Проектировал архитектуру проекта и разбиение его на микросервисы.<br>
        🔹Разработал систему синхронизации данных в реальном времени.<br>
        🔹Придумал гибкое конфигурирование полей документов.<br>
        🔹Сделал систему поиска и разрешения конфликтов для защиты данных.<br>
        🔹Разработал механизм плагинов интеграции с новыми источниками.<br>
        🔹Интегрировал API Google Sheets, Helpdesk Eddy, Salesforce, Amo CRM.<br>
        🔹Спроектировал систему для легко масштабирования при нагрузках.<br>
        🔹Разработал гибкую систему pull и push сценариев синхронизации.<br>
        <br>
        Подробнее <a href="https://alex.md/#5" target="_blank">alex.md/#5</a><br>
        <br>
        ⚡️Python, FastAPI, SqlAlchemy Alembic, Asyncio, PostgreSQL, RabbitMQ, Multiprocessing, Микросервисная архитектура, pytest, Docker
        `,
    },
    {
        'company': 'SibEDGE',
        'link': 'sibedge.com',
        'desc': 'Python developer',
        'term': '1 год',
        'text': `
        Работал в команде в качестве основного backend-разработчика. Вместе мы разработали с нуля проект в сфере энергетики.<br>
        <br>
        🔹Проектирование микросервисной архитектуры проекта.<br>
        🔹Создал систему распределенных воркеров.<br>
        🔹Масштабирование системы на несколько десятков серверов.<br>
        🔹Разработал панель управления задачами и воркерами.<br>
        🔹Разработал библиотеку для интеграции сервиса с другими проектами.<br>
        <br>
        Подробнее <a href="https://alex.md/#4" target="_blank">alex.md/#4</a><br>
        <br>
        ⚡️Python, FastAPI, SqlAlchemy Alembic, PostgreSQL, RabbitMQ, Микросервисная архитектура, Multiprocessing, pytest, Docker
        <div class="page-break"></div>
        `,
    },
    {
        'company': 'Nekor',
        'link': 'nekor.ru',
        'desc': 'Python developer',
        'term': '1 год',
        'text': `
        Проектная работа для nekor.ru. Создал с нуля B2B-сервис для предоставления платного доступа к различным API компании.<br>
        <br>
        🔹Разработал proxy-сервис между клиентом и реальным API на aiohttp.<br>
        🔹Спроектировал архитектуру для легкого масштабирования.<br>
        🔹Создал личный кабинет клиента, где он может: купить доступ к API.<br>
        🔹Разработал админ панель для управления API и клиентами.<br>
        🔹Сделал генератор документации для API с собственным форматом.<br>
        🔹Реализовал ведение статистики запросов с хранением в ClickHouse.<br>
        🔹Использовал асинхронный подход для получения максимальной скорости запросов.<br>
        <br>
        Подробнее <a href="https://alex.md/#3" target="_blank">alex.md/#3</a><br>
        <br>
        ⚡️Python, aiohttp, Django, asyncio, SqlAlchemy Core, PostgreSQL, ClickHouse, Redis, Микросервисная архитектура, Асинхронность, pytest, Docker
        `,
    },
    {
        'company': 'Atom Secure',
        'link': null,
        'desc': 'Python developer',
        'term': '1 год 1 месяц',
        'text': `
        Работал в команде над системой управления логами, отслеживания угроз и атак на серверах. Приложение устанавливается на сервер и анализирует логи выявляя события, которые могут свидетельствовать об угрозе.<br>
        <br>
        🔹Участвовал в проектировании архитектуры и выборе технологий.<br>
        🔹Сделал систему поиска логов и доставки их в реальном времени.<br>
        🔹Работал с базой ClickHouse для сбора аналитики и статистики.<br>
        🔹Разработал <a href="https://github.com/qvp/aiochorm" target="_blank">aiochorm</a> - асинхронная clickhouse orm.<br>
        🔹Создавал различные REST API системы.<br>
        🔹Подружил Django Rest framework с clickhouse ORM.<br>
        🔹Участвовал в перекрестном код-ревью.<br>
        🔹Покрывал свой код unit-тестами.<br>
        <br>
        Подробнее <a href="https://alex.md/#2" target="_blank">alex.md/#2</a><br>
        <br>
        ⚡️Python, PostgreSQL, ClickHouse, Redis, Django, DRF, Channels, Celery, unittest, Docker, Асинхронность
        <div class="page-break"></div>
        `,
    },
    {
        'company': 'Wiki Item',
        'link': null,
        'desc': 'PHP developer',
        'term': '1 год 3 месяца',
        'text': `
        <a href="https://wikiitem.com" target="_blank">wikiitem.com</a><br>
        Разработал с нуля маркетплейс похожий на Яндекс Маркет и Википедию. Товары парсятся из Aliexpress, Яндекс Маркета и Amazon. Однако пользователи могут сами добавлять или редактировать карточки товаров за что будет начислен рейтинг. При изменении создается новая версия, через интерфейс можно откатиться до любой версии.<br>
        <br>
        🔹Спроектировал базу данных с более чем 40 таблицами.<br>
        🔹База данных насчитывает более 500 000 товаров.<br>
        🔹Писал и оптимизировал сложные SQL-запросы.<br>
        🔹Продумал архитектуру проекта выделив отдельные микросервисы.<br>
        🔹Спроектировал систему версий чтобы можно было откатить изменения.<br>
        🔹Создал парсер товаров из Яндекс Маркет.<br>
        🔹Создал парсер изображений из Google Images.<br>
        🔹Сделал систему конфигов полей для очистки и преобразования данных после парсинга.<br>
        🔹Занимался оптимизацией БД и кода для сокращения времени ответа.<br>
        🔹Разработал 4 вспомогательных микросервиса.<br>
        🔹Интегрировал API Ebay, Amazon, Aliexpress, YouTube, Яндекс Маркет.<br>
        <br>
        Подробнее <a href="https://alex.md/#1" target="_blank">alex.md/#1</a><br>
        <br>
        ⚡️SQL, PostgreSQL, Микросервисная архитектура, PHP, Laravel, Slim, tests
        `,
    },
    {
        'company': 'Astrologiko',
        'link': null,
        'desc': 'PHP developer',
        'term': '8 месяцев',
        'text': `
        <a href="https://astrologiko.com" target="_blank">astrologiko.com</a><br>
        Разработал с нуля сервис генерации персонализированных гороскопов. Бесплатная и премиум версия. За отдельную плату клиенты могут поговорить в онлайн-чате с астрологом. Админ панель.<br>
        <br>
        🔹Генерация персонального гороскопа на основе положения планет.<br>
        🔹Онлайн чат с астрологом по протоколу Websockets.<br>
        🔹Принятие платежей и отправка чеков в налоговую.<br>
        🔹Управление подписками пользователей.<br>
        🔹Парсинг координат планет и других данных с нескольких сайтов<br>
        🔹Админ панель для управления пользователями, астрологами, чатами.<br>
        🔹Импорт и приглашение друзей из почты.<br>
        🔹Программная отрисовка натальной карты.<br>
        🔹Мини игра ТАРО.<br>
        <br>
        ⚡️SQL, MySQL, Websockets, PHP, Laravel framework, tests
        <div class="page-break"></div>
        `,
    },
    {
        'company': 'SimLead',
        'link': null,
        'desc': 'PHP developer',
        'term': '2 года 2 месяца',
        'text': `
        Работал над несколькими проектами в качестве штатного сотрудника в аутсорс компании.<br>
        <br>
        <a href="https://textdeliver.com" target="_blank">textdeliver.com</a> - сервис для создания смс и e-mail рассылок, а так же роботизированных звонков. Разработал основную часть проекта. Интегрировал API: Twillio, CallRail, CallFire, MailChimp.<br>
        <br>
        <a href="https://pressplay.io" target="_blank">pressplay.io</a> - конструктор видео landing page. Разработка новых функций и поддержка. Интегрировал API: AWS file storage.<br>
        <br>
        <a href="https://a2xanxiety.com" target="_blank">a2xanxiety.com</a> - интернет магазин и CRM. Разрабатывал с нуля.<br>
        <br>
        ⚡️SQL, MySQL, PHP, Laravel framework, tests
        `,
    },
    {
        'company': 'ЧоПочом',
        'link': 'chopochom.com',
        'desc': 'PHP developer',
        'term': '8 месяцев',
        'text': `
        С нуля разработал систему для автоматизации процессов создания и управления контекстной рекламой Yandex Direct для рекламного агенства ЧоПочом.<br>
        <br>
        🔹Спроектировал базу данных с более чем 30 таблицами.<br>
        🔹Писал и оптимизировал сложные SQL запросы.<br>
        🔹Разработал менеджер фоновых задач (похожий на celery + flower).<br>
        🔹Сделал полную интеграцию приложения с Yandex Direct.<br>
        🔹Интегрировал платежные системы WebMoney, Yandex Money.<br>
        <br>
        ⚡️SQL, MySQL, PHP, Yii framework
        `,
    },
];
